#include <stdio.h> //тіпа плагін йо
#include <math.h> //майж тож саме, для математитних дій

int main() { //основна змінна 
    int a, b; //змінна а і змінна б

    //блочок введення даних з клави
    printf("Введіть перше ціле число йо: ");
    scanf("%d", &a); //буковки забороняю писати!

    printf("Введіть друге ціле число йо: ");
    scanf("%d", &b); 

    //туи всі математичні дії крч
    double Justice_for_All = (a + b) / 2.0; //double матиматична функція додана плагіном math.h йомайо
    int Master_of_Puppets = (a * a) - (b * b); //обчислює різницю квадратів 
    int Ride_the_Lightning = b * (a + b); //а тут добуток другого, і суми чисел, вот

    //результати на сцену! 
    printf("\nРезультати обчислень йо:\n");
    printf("Середнє арифметичне йо: %.2f\n", Justice_for_All);     
    printf("Різниця квадратів йо: %d\n", Master_of_Puppets);
    printf("Добуток другого і суми чисел йомайо: %d\n", Ride_the_Lightning);

    return 0; //пака
}