#include <stdio.h>
#include <math.h>

int main() {
    int x, y, z;
    double f;

    //писати цифіркі
    printf("Введіть ціле значення x йо: ");
    scanf("%d", &x);
    printf("Введіть ціле значення y йо: ");
    scanf("%d", &y);
    printf("Введіть ціле значення z йо: ");
    scanf("%d", &z);

    //перевірка на допустимість значень цейво, якщо буде помилка там
    if ((x + y) < 0) {
        printf("Йомайо: неможливо обчислити sqrt(x + y), оскільки x + y < 0\n");
        return 1; //сумний кінець
    }

    //обчислює значення функції тіпа
    f = (pow(x, 2) + pow(z, 2)) / sqrt(x + y) + cbrt(x + y + z);

    //бац, результат
    printf("Обчислення за формулою йо: f = (x^2 + z^2) / sqrt(x + y) + cbrt(x + y + z)\n");
    printf("Введено йо: x = %d, y = %d, z = %d\n", x, y, z);
    printf("Результат йо: f = %.6f\n", f);

    return 0; //хеппі кінець
}
