#include <stdio.h> //плагіг для роботи 

int main() { //int зиінна main тіпа центральна прога 
    int d;  //змінна з зберіганням чотирьохзначного числа 

    printf("Введіть ціле чотиризначне число йоу: "); //printf виведення цифр на екран 
    scanf("%d", &d); //scanf виведення з клавіатури в програму 


    if (d < 1000 || d > 9999) { //if умова при якому якщо задане число маньше чотирьохзначного числа або більше, зьявиться насмтупний текст 
        printf("Ужс: це не чотиризначне число.\n");
        return 1; //програма всьо гата
    }

    int Korn = d / 1000;                        // перша цифра           d відкидає три останні цифри з 1000 тіпа
    int Limp_Bizkit = (d / 100) % 10;           // друга цифра           d відкидає два останніх числа 
    int Capucino = (d / 10) % 10;               // дап. і                d відкидає останнє число 
    int Linkin_Park_yo = d % 10;                // оп оп.                d обирає останнє число 

    int R = Korn - Linkin_Park_yo; //int R обраховуєм різницю першого і останього числа ого 
    int S = Limp_Bizkit + Capucino; //int S обрахо*9вуєм сумму другого і третього числа йоу

    printf("R = %d, S = %d\n", R, S); // виводимо результат юху

    return 0; //завершення програми
}