#include <stdio.h> //ну бібліотека

int main() {
    int slayer;
    
    printf("Введіть чотиризначне число: ");
    scanf("%d", &slayer);

    if (slayer < 1000 || slayer > 9999) { //ну тут if тіпа перевіряє чи чило ріл 4рйохзначне
        printf("Число не є чотиризначним йомайо!\n");
        
        return 1; //кінець, число не чотирьохзначне
    }

    //тут я зробив число константним бо пркольно (насправді боюся що ольга іванівна може посварити)
    const int gate = slayer;

    //розділяємо числа на окремі цифри йомайо
    const int d1 = gate / 1000;           
    const int d2 = (gate / 100) % 10;     
    const int d3 = (gate / 10) % 10;   
    const int d4 = gate % 10;  

    //і тут виконуєм пошук найменшої
    int popa = d1; //попа це найменша цифра, і перевірку починаємо з першої
    int popi = 1;

    if (d2 < popa) { //зрівняю попу зругим, якщо друге більше то вона стає попою
        popa = d2;
        popi = 2;
    } else if (d3 < popa) { //ну і аналогічно
        popa = d3;
        popi = 3;
    } else if (d4 < popa) { //офізщаоіва
        popa = d4;
        popi = 4;
    }

    //результати!

    printf("Йо найменша цифра: %d\n", popa);
    printf("Її позиція (зліва направо оп): %d\n", popi);

    return 0; //всьо
}