#include <stdio.h>
#include <math.h> //це вже ми не раз проходили...

int main() {
    double x, y, b, f;

    printf("Введіть x: ");
    scanf("%lf", &x);
    printf("Введіть y: ");
    scanf("%lf", &y);
    printf("Введіть b: ");
    scanf("%lf", &b);

    if (x < 0) { //це вже роходили
        f = 3 * x * x + 2 * y;
    } else { //а тут прикольно, якщо if не може дати результат то задачка переходить до else
        if (x <= 2) { //в якій створено ще один if який це вже виконає
            f = 4.0 / (x * x - 2 * b) + x;
        } else { //а це для випадку якщо воно в друге щось не пон, і дає вже остаточну цейво
            f = (b - sqrt(x + 2)) / x;
        }
    }

    printf("f(x) = %lf\n", f); //ну і виводиво цю цейво в термінал

    return 0; //всьо
}